src/Documents/ЗаявкаНаУценку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаявкаНаУценку</Name>
			<Comment>Заявка на уценку</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОконачанияДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласоватьВсё</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
					<Comment>Таблица скидок</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Товар или группа на которую действует скидка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВычисления</Name>
							<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидки</Name>
							<Comment>Значение скидки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Comment>Штрих-код</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОконачанияДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад/Отдел</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОкругления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Подразделения, для которых устанавливается цены</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Comment>Подразделение компании для которого изменяется ассортимент данным документом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УценкаТовара</Name>
					<Comment>Уценка товара</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОконачанияДействия</Name>
							<Comment>Дата начала действия цены</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СтруктураИерархииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтруктураИерархииНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте регламентированного учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДСУпр</Name>
					<Comment>Сумма в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия, по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СкидкиСпособВычисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СкидкиСпособВычисления</Name>
			<Comment>Способ вычисления</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абсолютная</Name>
					<Comment>Абсолютная скидка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Относительная</Name>
					<Comment>Относительная скидка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяЦена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗаявкаНаУценку/Ext/ManagerModule.bsl
// Модуль менеджера документа "Назначение скидки строки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Функция получает таблицу скидок и их параметров действия
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьТаблицуСкидок(Объект) Экспорт
	
	//Если Объект.ДокументЦентральногоОфиса И Объект.ХозОперация = Справочники.ХозОперации.УценкаОвощей Тогда
	//	ПолучитьПриоритет = Ложь;
	//Иначе
	//	ПолучитьПриоритет = Истина;
	//КонецЕсли;
	//
	//ТекстЗапроса = "
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	УценкаТовараСкидки.Номенклатура КАК Номенклатура,
	//|	УценкаТовараСкидки.СкладКомпании КАК ЗалОбслуживания,
	//|	УценкаТовараСкидки.ШтрихКод КАК ШтрихКод,
	//|	УценкаТовараСкидки.Ссылка КАК РегистраторСкидки,
	//|	УценкаТовараСкидки.ЗначениеСкидки КАК ЗначениеСкидки,
	//|	УценкаТовараСкидки.СпособВычисления КАК СпособВычисления,
	//|	УценкаТовараСкидки.ВариантОкругления КАК ВариантОкругления,
	//|	&СрокДействия КАК СрокДействия
	//|ПОМЕСТИТЬ
	//|	НазначениеСкидокСтроки
	//|ИЗ
	//|	Документ.УценкаТовара.Скидки КАК УценкаТовараСкидки
	//|ГДЕ
	//|	УценкаТовараСкидки.Ссылка = &Ссылка
	//|;
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	&ПодразделениеКомпании КАК ПодразделениеКомпании,
	//|	ТаблицаСкидок.СрокДействия КАК СрокДействия,
	//|	ТаблицаСкидок.ШтрихКод
	//|ПОМЕСТИТЬ
	//|	ТаблицаСкидок
	//|ИЗ
	//|	НазначениеСкидокСтроки КАК ТаблицаСкидок
	//|;
	//|" + ?(ПолучитьПриоритет, "
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	УценкаТовараСрезПоследнихПриоритет.Номенклатура,
	//|	ИСТИНА КАК Приоритет
	//|ПОМЕСТИТЬ
	//|	УценкаСПриоритетом
	//|ИЗ
	//|	РегистрСведений.УценкаТовара.СрезПоследних(&Дата, (НЕ Регистратор = &Ссылка) И Приоритет = ИСТИНА И ПодразделениеКомпании = &ПодразделениеКомпании) КАК УценкаТовараСрезПоследнихПриоритет
	//|;", "")+"
	//|
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	НазначениеСкидокСтрокиСкидки.Номенклатура КАК Номенклатура,
	//|	НазначениеСкидокСтрокиСкидки.ЗалОбслуживания КАК ЗалОбслуживания,
	//|	НазначениеСкидокСтрокиСкидки.ШтрихКод КАК ШтрихКод,
	//|	НазначениеСкидокСтрокиСкидки.РегистраторСкидки КАК РегистраторСкидки,
	//|	НазначениеСкидокСтрокиСкидки.ЗначениеСкидки КАК ЗначениеСкидки,
	//|	НазначениеСкидокСтрокиСкидки.СпособВычисления КАК СпособВычисления,
	//|	НазначениеСкидокСтрокиСкидки.ВариантОкругления КАК ВариантОкругления,
	//|	&ОформленВЦО КАК ОформленВЦО,
	//|	" + ?(ПолучитьПриоритет, "ЕстьNULL(УценкаСПриоритетом.Приоритет, Ложь) КАК Приоритет,", "ИСТИНА КАК Приоритет,") + "
	//|	ЕСТЬNULL(УценкаТовараСрезПоследних.Действует, ЛОЖЬ) КАК СкидкаУстановлена
	//|ИЗ
	//|	НазначениеСкидокСтроки КАК НазначениеСкидокСтрокиСкидки
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрСведений.УценкаТовара.СрезПоследних(
	//|				&Дата,
	//|				(НЕ Регистратор = &Ссылка) И 
	//|				(ПодразделениеКомпании, СрокДействия, ШтрихКод) В
	//|				(ВЫБРАТЬ ПодразделениеКомпании, СрокДействия, ШтрихКод ИЗ ТаблицаСкидок)) КАК УценкаТовараСрезПоследних
	//|ПО
	//|	НазначениеСкидокСтрокиСкидки.ЗалОбслуживания = УценкаТовараСрезПоследних.ЗалОбслуживания
	//|	И НазначениеСкидокСтрокиСкидки.ШтрихКод = УценкаТовараСрезПоследних.ШтрихКод
	//|	И НазначениеСкидокСтрокиСкидки.Номенклатура = УценкаТовараСрезПоследних.Номенклатура
	//|	И НазначениеСкидокСтрокиСкидки.СпособВычисления = УценкаТовараСрезПоследних.СпособВычисления
	//|	И НазначениеСкидокСтрокиСкидки.ЗначениеСкидки = УценкаТовараСрезПоследних.ЗначениеСкидки
	//|	И НазначениеСкидокСтрокиСкидки.ВариантОкругления = УценкаТовараСрезПоследних.ВариантОкругления
	//|	И (УценкаТовараСрезПоследних.Действует)
	//|" + ?(ПолучитьПриоритет, "
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	УценкаСПриоритетом КАК УценкаСПриоритетом
	//|ПО
	//|	НазначениеСкидокСтрокиСкидки.Номенклатура = УценкаСПриоритетом.Номенклатура", "");
	//
	//Запрос 												= Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Ссылка",					Объект.Ссылка);
	//Запрос.УстановитьПараметр("Дата",					Объект.ДатаНачалаДействия);
	//Запрос.УстановитьПараметр("ПодразделениеКомпании", 	Объект.ПодразделениеКомпании);
	//Запрос.УстановитьПараметр("СрокДействия",           Объект.ДатаОконачанияДействия);
	//Запрос.УстановитьПараметр("НоменклатураПустая",    	Справочники.Номенклатура.ПустаяСсылка());
	//Запрос.УстановитьПараметр("ОформленВЦО",			Объект.ДокументЦентральногоОфиса);
	//
	//Возврат Запрос.Выполнить();
	
КонецФункции // ПолучитьТаблицуСкидок()

Функция ПолучитьТаблицуЦен(Объект, ТабличнаяЧасть, ТекущаяСтрока=Неопределено) Экспорт
	
	//Момент = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	ТабличнаяЧасть.Номенклатура.Родитель КАК Родитель
	|ПОМЕСТИТЬ
	|	ТаблицаНоменклатуры
	|ИЗ
	|	ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатуры.Родитель КАК Родитель
	|ПОМЕСТИТЬ
	|	ГруппыТоваров
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|ВЫБРАТЬ
	|	ГруппыТоваров.Родитель КАК Группа,
	|	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Число) КАК ЛимитУценки,
	|	ГруппыТоваров.Родитель КАК Родитель,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархии
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ПО
	|	ГруппыТоваров.Родитель = ДополнительныеСведения.Объект И 
	|	ДополнительныеСведения.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ЛимитУценки)
	|ГДЕ
	|	ГруппыТоваров.Родитель.ПометкаУдаления = Ложь
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураИерархииНоменклатуры.Группа,
	|	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Число) КАК ЛимитУценки,
	|	ГруппыТоваров.Родитель КАК Родитель,
	|	СтруктураИерархииНоменклатуры.Порядок КАК Приоритет
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
	|ПО
	|	ГруппыТоваров.Родитель = СтруктураИерархииНоменклатуры.Номенклатура
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ПО
	|	СтруктураИерархииНоменклатуры.Группа = ДополнительныеСведения.Объект И 
	|	ДополнительныеСведения.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ЛимитУценки)
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархии.Родитель КАК Родитель,
	|	МИНИМУМ(ТаблицаИерархии.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархииСрез
	|ИЗ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИерархии.Родитель
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархииСрез.Родитель КАК Родитель,
	|	ТаблицаИерархии.ЛимитУценки КАК ЛимитУценки,
	|	ТаблицаИерархии.Группа
	|ПОМЕСТИТЬ
	|	ЛимитУценкиПоГруппам
	|ИЗ
	|	ТаблицаИерархииСрез КАК ТаблицаИерархииСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|ПО
	|	ТаблицаИерархии.Родитель = ТаблицаИерархииСрез.Родитель И 
	|	ТаблицаИерархии.Приоритет = ТаблицаИерархииСрез.Приоритет
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаИерархии
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаИерархииСрез
	|;
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	МАКСИМУМ(ПартииТоваровКомпании.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ТаблицаПартий
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТабличнаяЧасть
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ПО
	|	ТабличнаяЧасть.Номенклатура = ПартииТоваровКомпании.Номенклатура
	|ГДЕ
	|	ПартииТоваровКомпании.СкладКомпании.ПодразделениеКомпании = &Подразделение И 
	|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И 
	|	ПартииТоваровКомпании.Период <= &НаДату И 
	|	ПартииТоваровКомпании.Количество > 0
	|СГРУППИРОВАТЬ ПО
	|	ТабличнаяЧасть.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	МАКСИМУМ(ВложенныйЗапрос.ЦенаЗакупочная) КАК ЦенаЗакупочная,
	|	МАКСИМУМ(ВложенныйЗапрос.ЦенаРозничная) КАК ЦенаРозничная
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПартий.Номенклатура,
	|		СУММА(ПартииТоваровКомпании.Сумма)/СУММА(ПартииТоваровКомпании.Количество) КАК ЦенаЗакупочная,
	|		0 КАК ЦенаРозничная
	|	ИЗ
	|		ТаблицаПартий КАК ТаблицаПартий
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|	ПО
	|		ТаблицаПартий.Номенклатура = ПартииТоваровКомпании.Номенклатура И 
	|		ТаблицаПартий.ВидДвижения = ПартииТоваровКомпании.ВидДвижения И 
	|		ТаблицаПартий.Период = ПартииТоваровКомпании.Период И 
	|		ПартииТоваровКомпании.Количество > 0
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПартий.Номенклатура
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|		
	|	ВЫБРАТЬ
	|		ЦеныСрезПоследних.Номенклатура,
	|		0,
	|		ЦеныСрезПоследних.Цена
	|	ИЗ
	|		РегистрСведений.Цены.СрезПоследних(&МоментВремени,
	|			ТипЦен = &ТипЦенПродажи
	|			И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			И ПодразделениеКомпании = &Подразделение
	|			И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|			И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТабличнаяЧасть)
	|		И (Номенклатура.ОсновнаяЕдиницаИзмерения = ЕдиницаИзмерения
	|	ИЛИ ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))) КАК ЦеныСрезПоследних) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаУценкаТовара.Период,
	|	ТаблицаУценкаТовара.Номенклатура,
	|	ТаблицаУценкаТовара.ОформленВЦО КАК ОформленВЦО
	|ПОМЕСТИТЬ
	|	ТаблицаУценкаТовара
	|ИЗ
	|	РегистрСведений.УценкаТовара КАК ТаблицаУценкаТовара
	|ГДЕ
	|	ТаблицаУценкаТовара.Период <= &МоментВремени И 
	|	(НЕ ТаблицаУценкаТовара.Регистратор = &Регистратор) И 
	|	ТаблицаУценкаТовара.ПодразделениеКомпании = &Подразделение И 
	|	ТаблицаУценкаТовара.Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТаблицаНоменклатуры)
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаУценкаТовараСрез.Номенклатура,
	|	МАКСИМУМ(ТаблицаУценкаТовараСрез.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ТаблицаУценкаТовараСрез
	|ИЗ
	|	ТаблицаУценкаТовара КАК ТаблицаУценкаТовараСрез
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУценкаТовараСрез.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаУценок.Номенклатура,
	|	МАКСИМУМ(ТаблицаУценок.ОформленВЦО) КАК ОформленВЦО
	|ПОМЕСТИТЬ
	|	УценкаСПриоритетом
	|ИЗ
	|	(
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		УценкаТовараСрезПоследнихПриоритет.Номенклатура,
	|		ИСТИНА КАК ОформленВЦО
	|	ИЗ
	|		РегистрСведений.УценкаТовара.СрезПоследних(&МоментВремени, (НЕ Регистратор = &Регистратор) И Приоритет = ИСТИНА И ПодразделениеКомпании = &Подразделение И Номенклатура В
	|				(ВЫБРАТЬ Номенклатура ИЗ ТаблицаНоменклатуры)) КАК УценкаТовараСрезПоследнихПриоритет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаУценкаТовараСрез.Номенклатура,
	|		ТаблицаУценкаТовара.ОформленВЦО КАК ОформленВЦО
	|	ИЗ
	|		ТаблицаУценкаТовараСрез КАК ТаблицаУценкаТовараСрез
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаУценкаТовара КАК ТаблицаУценкаТовара
	|	ПО
	|		ТаблицаУценкаТовараСрез.Номенклатура = ТаблицаУценкаТовара.Номенклатура И 
	|		ТаблицаУценкаТовараСрез.Период = ТаблицаУценкаТовара.Период
	|	ГДЕ
	|		ТаблицаУценкаТовара.ОформленВЦО = ИСТИНА) КАК ТаблицаУценок
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУценок.Номенклатура
	|;
	|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	УценкаТовараСрезПоследнихПриоритет.Номенклатура,
	//|	ИСТИНА КАК Приоритет
	//|ПОМЕСТИТЬ
	//|	УценкаСПриоритетом
	//|ИЗ
	//|	РегистрСведений.УценкаТовара.СрезПоследних(&МоментВремени, (НЕ Регистратор = &Регистратор) И Приоритет = ИСТИНА И ПодразделениеКомпании = &Подразделение) КАК УценкаТовараСрезПоследнихПриоритет
	//|;
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	УценкаТовараСрезПоследнихПриоритет.Номенклатура,
	//|	УценкаТовараСрезПоследнихПриоритет.ОформленВЦО КАК ОформленВЦО
	//|ПОМЕСТИТЬ
	//|	УценкаСПриоритетом
	//|ИЗ
	//|	РегистрСведений.УценкаТовара.СрезПоследних(&МоментВремени, (НЕ Регистратор = &Регистратор) И ПодразделениеКомпании = &Подразделение И Номенклатура В
	//|			(ВЫБРАТЬ Номенклатура ИЗ ТаблицаНоменклатуры)) КАК УценкаТовараСрезПоследнихПриоритет
	//|ГДЕ
	//|	УценкаТовараСрезПоследнихПриоритет.ОформленВЦО = ИСТИНА
	//|;
	//|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.НомерСтроки-1 КАК ИндексСтроки,
	|	ТабличнаяЧасть.Номенклатура,
	|	ЕСТЬNULL(ТаблицаЦен.ЦенаЗакупочная, 0) КАК ЦенаЗакупочная,
	|	ЕСТЬNULL(ТаблицаЦен.ЦенаРозничная, 0) КАК ЦенаРозничная,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.ЦенаЗакупочная ЕСТЬ NULL ТОГДА 0
	|		КОГДА ЛимитУценкиПоГруппам.ЛимитУценки ЕСТЬ NULL ТОГДА ТаблицаЦен.ЦенаЗакупочная
	|		ИНАЧЕ ТаблицаЦен.ЦенаЗакупочная+ТаблицаЦен.ЦенаЗакупочная*(ЛимитУценкиПоГруппам.ЛимитУценки/100)
	|	КОНЕЦ КАК ЦенаЛимита,
	|	ЕСТЬNULL(ЛимитУценкиПоГруппам.Группа, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Группа,
	|	ЕСТЬNULL(ЛимитУценкиПоГруппам.ЛимитУценки, 0) КАК ЛимитУценки,
	|	ЕСТЬNULL(УценкаСПриоритетом.ОформленВЦО, Ложь) КАК ОформленВЦО
	|ИЗ
	|	ТабличнаяЧасть КАК ТабличнаяЧасть
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	ТабличнаяЧасть.Номенклатура = ТаблицаЦен.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ЛимитУценкиПоГруппам КАК ЛимитУценкиПоГруппам
	|ПО
	|	ТабличнаяЧасть.Номенклатура.Родитель = ЛимитУценкиПоГруппам.Родитель
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	УценкаСПриоритетом КАК УценкаСПриоритетом
	|ПО
	|	ТабличнаяЧасть.Номенклатура = УценкаСПриоритетом.Номенклатура
	|";
	
	Если ТекущаяСтрока = Неопределено Тогда
		Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить( , "НомерСтроки, Номенклатура"));
	Иначе
		Строки = Новый Массив;
		Строки.Добавить(ТекущаяСтрока);
		Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить(Строки, "НомерСтроки, Номенклатура"));
	КонецЕсли;
	
	//Запрос.УстановитьПараметр("Момент",        Момент);
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Объект.ДатаНачалаДействия, ВидГраницы.Исключая));
	//Иначе
	Запрос.УстановитьПараметр("МоментВремени", Объект.ДатаНачалаДействия);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	//КонецЕсли;
	Запрос.УстановитьПараметр("НаДату",        Объект.ДатаНачалаДействия);
	Запрос.УстановитьПараметр("ТипЦенПродажи", Объект.ПодразделениеКомпании.ТипЦенРеализации);
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
	//Запрос.УстановитьПараметр("",ПравоПользователя("ПравоВводаДокументовЦО", Объект);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("ДатаНачалаДействия");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Скидки");
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("Скидки.Номенклатура");
	ОбязательныеРеквизиты.Добавить("Скидки.ШтрихКод");
	ОбязательныеРеквизиты.Добавить("Скидки.СпособВычисления");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы скидки
	УникальныеСкидки = Новый Массив();
	
	УникальныеСкидки.Добавить("ШтрихКод");
	УникальныеСкидки.Добавить("ДатаНачалаДействия");
	УникальныеСкидки.Добавить("ДатаОконачанияДействия");
	УникальныеСкидки.Добавить("СкладКомпании");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Скидки", УникальныеСкидки);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", ИСТИНА);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	Документы.УценкаТовара.ЗаполнитьРеквизитыЦен(Объект);
	Документы.УценкаТовара.ЗаполнитьИтоговыеЦены(Объект);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	Документы.УценкаТовара.ЗаполнитьРеквизитыЦен(Объект);
	Документы.УценкаТовара.ЗаполнитьИтоговыеЦены(Объект);
	
	// Отключим установку цен, так как в данном документе она не нужна
	ПараметрыДействия.ТребуетсяУстановкаЦен = Ложь;
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "СКИДКИ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия, "Скидки");
	
	ЕстьЗапретРедактирования = ЕстьРеквизит(Объект, "ЗапретРедактированияЦены", "Скидки");
	
	ШтрихКодыОбъекта = Новый ТаблицаЗначений;
	Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
		//ЭтоВесовой = (Строка.Номенклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Весовой);
		//Префикс = "";
		//Если ЭтоВесовой Тогда
		//	Префикс = СокрЛП(Константы.ПрефиксВесовогоШК.Получить());
		//КонецЕсли;
		//
		//Префикс = Префикс+"9";
		//ШтрихКодыОбъекта  = ШтрихкодированиеВызовСервера.ПолучитьШтрихКодОбъекта(Строка.Номенклатура,,, Истина);
		//Если ПустаяСтрока(Строка.ШтрихКод) ИЛИ (НЕ СтрНайти(Строка.Штрихкод, Префикс) = 1) ИЛИ ШтрихКодыОбъекта.Найти(Строка.ШтрихКод) = Неопределено Тогда
		//	Для Каждого ТекущаяСтрока Из ШтрихКодыОбъекта Цикл
		//		Если ТекущаяСтрока.Запрет Тогда
		//			Продолжить;
		//		КонецЕсли;
		//		Если СтрНайти(ТекущаяСтрока.Штрихкод, Префикс) = 1 Тогда
		//			Строка.Штрихкод = ТекущаяСтрока.Штрихкод;
		//			Прервать;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
		Строка.Штрихкод = ШтрихкодированиеВызовСервера.ПолучитьШтрихкодУценки(Строка.Номенклатура);
		
		// Выведем остаток по складу / подразделению.
		ЗапросОстатки = Новый Запрос(
		"ВЫБРАТЬ
		|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И "+?(ЗначениеЗаполнено(Строка.СкладКомпании),"СкладКомпании = &СкладКомпании","СкладКомпании.ПодразделениеКомпании = &ПодразделениеКомпании")+") КАК ОстаткиТоваровКомпанииОстатки
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура");
		ЗапросОстатки.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
		ЗапросОстатки.УстановитьПараметр("СкладКомпании",Строка.СкладКомпании);
		ЗапросОстатки.УстановитьПараметр("ПодразделениеКомпании",Объект.ПодразделениеКомпании);
		ЗапросОстатки.УстановитьПараметр("Дата",Объект.Дата);
		ВыбЗапрос = ЗапросОстатки.Выполнить().Выбрать();
		Если ВыбЗапрос.Следующий() Тогда
			Строка.Количество = ВыбЗапрос.Количество;
		Иначе
			Строка.Количество = 1;
		КонецЕсли;
		
		// Сеисок ШК
		ЗапросШК = Новый Запрос(
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод,
		|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Объект = &Номенклатура
		|	И (Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|			ИЛИ Штрихкоды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))");
		ЗапросШК.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
		ЗапросШК.УстановитьПараметр("ЕдиницаИзмерения",Строка.Номенклатура.ОсновнаяЕдиницаИзмерения);
		Строка.ШтрихКоды.ЗагрузитьЗначения(ЗапросШК.Выполнить().Выгрузить().ВыгрузитьКолонку("Штрихкод"));
		
		//Если (НЕ ЗначениеЗаполнено(Строка.ЗначениеСкидки)) ИЛИ (НЕ ЗначениеЗаполнено(Строка.ШтрихКод)) Тогда
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
		//	Запрос.УстановитьПараметр("Номенклатура",  Строка.Номенклатура);
		//	Запрос.УстановитьПараметр("НаДату",        Объект.ДатаНачалаДействия);
		//	Запрос.УстановитьПараметр("Ссылка",        Объект.Ссылка);
		//	
		//	Запрос.Текст = "
		//	|ВЫБРАТЬ ПЕРВЫЕ 1
		//	|	УценкаТовара.ШтрихКод,
		//	|	УценкаТовара.ЗначениеСкидки,
		//	|	УценкаТовара.СпособВычисления,
		//	|	УценкаТовара.ВариантОкругления,
		//	|	УценкаТовара.Приоритет,
		//	|	УценкаТовара.ОформленВЦО КАК ОформленВЦО
		//	|ИЗ
		//	|	РегистрСведений.УценкаТовара КАК УценкаТовара
		//	|ГДЕ
		//	|	УценкаТовара.ПодразделениеКомпании = &Подразделение И 
		//	|	УценкаТовара.Номенклатура = &Номенклатура И 
		//	|	УценкаТовара.Период <= &НаДату И 
		//	|	(НЕ УценкаТовара.Регистратор = &Ссылка)
		//	|УПОРЯДОЧИТЬ ПО
		//	|	УценкаТовара.Приоритет УБЫВ,
		//	|	УценкаТовара.Период УБЫВ
		//	|";
		//	
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Если Выборка.Следующий() Тогда
		//		Если (НЕ ЗначениеЗаполнено(Строка.ЗначениеСкидки)) Тогда
		//			Строка.ЗначениеСкидки    = Выборка.ЗначениеСкидки;
		//			Строка.СпособВычисления  = Выборка.СпособВычисления;
		//			Строка.ВариантОкругления = Выборка.ВариантОкругления;
		//			Если ЕстьЗапретРедактирования Тогда
		//				Строка.ЗапретРедактированияЦены = (Выборка.ОформленВЦО ИЛИ Выборка.Приоритет);
		//			КонецЕсли;
		//		КонецЕсли;
		//		
		//		Если (НЕ ЗначениеЗаполнено(Строка.ШтрихКод)) Тогда
		//			Строка.ШтрихКод = Выборка.ШтрихКод;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
		Строка.Количество = 1;
	КонецЕсли;
	
	//Если ЕстьРеквизит(Объект, "ШтрихКоды", "Скидки") Тогда
	//	Строка.ШтрихКоды.Очистить();
	//	Для Каждого ТекущаяСтрока Из ШтрихКодыОбъекта Цикл
	//		Если ТекущаяСтрока.Запрет Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		Строка.ШтрихКоды.Добавить(ТекущаяСтрока.Штрихкод);
	//	КонецЦикла;
	//	
	//	Строка.ШтрихКоды.Добавить("Новый", "Получить новый");
	//	Строка.ШтрихКоды.Добавить("РучнойВвод", "Ручной ввод");
	//КонецЕсли;
	
	ЗащищенныеФункцииСервер.ЗаполнитьРеквизитЦенаБезНДС(Объект, Строка);
	
	ЗаполнитьРеквизитыЦен(Объект, Строка,, ПараметрыДействия);
	ЗаполнитьИтоговыеЦены(Объект, Строка,, ПараметрыДействия);
	
КонецПроцедуры // СкидкиНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "СкладКомпании" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиСкладКомпанииПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	//ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	//
	//ЗаполнитьРеквизитыЦен(Объект, ТекущаяСтрока = Неопределено, ИмяТабличнойЧасти = "Скидки", ПараметрыДействия);
	
КонецПроцедуры // СкидкиНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Значение Скидки" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиЗначениеСкидкиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЗаполнитьИтоговыеЦены(Объект, Строка,, ПараметрыДействия);
	
КонецПроцедуры // СкидкиЗначениеСкидкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Вариант Округления" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиВариантОкругленияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЗаполнитьИтоговыеЦены(Объект, Строка,, ПараметрыДействия);
	
КонецПроцедуры // СкидкиВариантОкругленияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Способ Вычисления" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиСпособВычисленияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЗаполнитьИтоговыеЦены(Объект, Строка,, ПараметрыДействия);
	
КонецПроцедуры // СкидкиСпособВычисленияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Способ Вычисления" в таблице "Скидки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкидкиКоличествоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЗаполнитьИтоговыеЦены(Объект, Строка,, ПараметрыДействия);
	
КонецПроцедуры // СкидкиСпособВычисленияПриИзменении()

// Процедура выполняет заполнение реквизита табличной части "товары" свободным остатком по складу.
//
Процедура ЗаполнитьРеквизитыЦен(Объект, ТекущаяСтрока = Неопределено, ИмяТабличнойЧасти = "Скидки", ПараметрыДействия = Неопределено) Экспорт
	
	Если НЕ ЕстьРеквизит(Объект, "ЦенаЗакупочная", ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	
	ТаблицаЦен = ПолучитьТаблицуЦен(Объект, ТабличнаяЧасть, ТекущаяСтрока);
	
	Для Каждого СтрокаЦен Из ТаблицаЦен Цикл
		ТекущаяСтрока = ТабличнаяЧасть[СтрокаЦен.ИндексСтроки];
		ТекущаяСтрока.ЦенаЗакупочная = СтрокаЦен.ЦенаЗакупочная;
		ТекущаяСтрока.ЦенаРозничная  = СтрокаЦен.ЦенаРозничная;
		ТекущаяСтрока.ЦенаЛимита     = Окр(СтрокаЦен.ЦенаЛимита, 2);
		ТекущаяСтрока.ГруппаЛимита   = СтрокаЦен.Группа;
		ТекущаяСтрока.ПроцентЛимита  = СтрокаЦен.ЛимитУценки;
		ТекущаяСтрока.ЗапретРедактированияЦены = СтрокаЦен.ОформленВЦО;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРеквизитыЦен()

Процедура ЗаполнитьИтоговыеЦены(Объект, ТекущаяСтрока = Неопределено, ИмяТабличнойЧасти = "Скидки", ПараметрыДействия = Неопределено) Экспорт
	
	Если НЕ ЕстьРеквизит(Объект, "ИтоговаяЦена", ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоОформленныеВЦО = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТолькоОформленныеВЦО", Ложь);
	
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	
	ФиксированнаяЦена = Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		Если ТолькоОформленныеВЦО И (НЕ ТекущаяСтрока.ЗапретРедактированияЦены) Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущаяСтрока.СпособВычисления = ФиксированнаяЦена Тогда
			ТекущаяСтрока.ИтоговаяЦена = ТекущаяСтрока.ЗначениеСкидки;
		ИначеЕсли НЕ ТекущаяСтрока.ЦенаРозничная = 0 И ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеСкидки) Тогда
			ИтоговаяЦена = ТекущаяСтрока.ЦенаРозничная - ТекущаяСтрока.ЦенаРозничная*(ТекущаяСтрока.ЗначениеСкидки/100);
			ТекущаяСтрока.ИтоговаяЦена = Справочники.ВариантыОкругления.ОкруглитьЦену(ТекущаяСтрока.ВариантОкругления, ИтоговаяЦена);
		Иначе
			ТекущаяСтрока.ИтоговаяЦена = ТекущаяСтрока.ЦенаРозничная;
		КонецЕсли;
		Если ТекущаяСтрока.ЦенаРозничная=0 Тогда
			ТекущаяСтрока.ПроцентУценки = 0;
		Иначе
			ТекущаяСтрока.ПроцентУценки = Окр(((ТекущаяСтрока.ЦенаРозничная-ТекущаяСтрока.ИтоговаяЦена)/ТекущаяСтрока.ЦенаРозничная)*100,2);
		КонецЕсли;
		Если ТекущаяСтрока.ЦенаЗакупочная=0 Тогда
			ТекущаяСтрока.ПроцентНаценкиРасчетный = 0;
		Иначе
			ТекущаяСтрока.ПроцентНаценкиРасчетный = Окр(((ТекущаяСтрока.ИтоговаяЦена-ТекущаяСтрока.ЦенаЗакупочная)/ТекущаяСтрока.ЦенаЗакупочная)*100,2);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	Для Каждого ТекущаяСтрока Из ТабличнаяЧасть Цикл
		
		Если ТолькоОформленныеВЦО И (НЕ ТекущаяСтрока.ЗапретРедактированияЦены) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.СпособВычисления = ФиксированнаяЦена Тогда
			ТекущаяСтрока.ИтоговаяЦена = ТекущаяСтрока.ЗначениеСкидки;
		ИначеЕсли НЕ ТекущаяСтрока.ЦенаРозничная = 0 И ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеСкидки) Тогда
			ИтоговаяЦена = ТекущаяСтрока.ЦенаРозничная - ТекущаяСтрока.ЦенаРозничная*(ТекущаяСтрока.ЗначениеСкидки/100);
			ТекущаяСтрока.ИтоговаяЦена = Справочники.ВариантыОкругления.ОкруглитьЦену(ТекущаяСтрока.ВариантОкругления, ИтоговаяЦена);
		Иначе
			ТекущаяСтрока.ИтоговаяЦена = ТекущаяСтрока.ЦенаРозничная;
		КонецЕсли;
	
		Если ТекущаяСтрока.ЦенаРозничная=0 Тогда
			ТекущаяСтрока.ПроцентУценки = 0;
		Иначе
			ТекущаяСтрока.ПроцентУценки = Окр(((ТекущаяСтрока.ЦенаРозничная-ТекущаяСтрока.ИтоговаяЦена)/ТекущаяСтрока.ЦенаРозничная)*100,2);
		КонецЕсли;
		Если ТекущаяСтрока.ЦенаЗакупочная=0 Тогда
			ТекущаяСтрока.ПроцентНаценкиРасчетный = 0;
		Иначе
			ТекущаяСтрока.ПроцентНаценкиРасчетный = Окр(((ТекущаяСтрока.ИтоговаяЦена-ТекущаяСтрока.ЦенаЗакупочная)/ТекущаяСтрока.ЦенаЗакупочная)*100,2);
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры // ЗаполнитьИтоговыеЦены()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.УценкаТовара",
		"УценкаТовара",
		НСтр("ru = 'Уценка товара'"),
		СсылкаНаДокумент);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		Неопределено,
		"Ценники",
		НСтр("ru = 'Печать ценников'"),
		СсылкаНаДокумент,
		"УправлениеПечатиЭтикетокИЦенниковКлиент.ПодготовкаПечати",
		,,,,
		Ложь);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		Неопределено,
		"Этикетки",
		НСтр("ru = 'Печать этикеток'"),
		СсылкаНаДокумент,
		"УправлениеПечатиЭтикетокИЦенниковКлиент.ПодготовкаПечати",
		,,,,
		Ложь);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УценкаТовара") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"УценкаТовара",
															НСтр("ru = 'Уценка товара'"),
															ПечатьУценкаТовара(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//	Адрес   - адрес структуры данных во временном хранилище.
//
Функция ПечатьУценкаТовара(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НазначениеУценки_УценкаТовара";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Получим макет печатной формы.
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УценкаТовара.УценкаТовара");
		
		// Установим параметры печати
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабличныйДокумент.АвтоМасштаб        = ИСТИНА;
		
		// Получение необходимых областей.
		ОбластьШапкаТаблицы    = Макет.ПолучитьОбласть("ШапкаТаблицы");		
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьПодвал 		   = Макет.ПолучитьОбласть("Подвал");
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Заголовок
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры,Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ,Документ.ХозОперация.Наименование);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		Если ЗначениеЗаполнено(Документ.ПодразделениеКомпании) И ЗначениеЗаполнено(Документ.ПодразделениеКомпании.КПП) Тогда
			СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
			ОбластьЗаголовок.Параметры.ОрганизацияПредставление = СтрЗаменить(СтрокаПредставления, ОбщегоНазначения.ПолучитьКППНаДату(Документ.Организация, ДатаДокумента), ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеКомпании, ДатаДокумента));
		Иначе	
		    ОбластьЗаголовок.Параметры.ОрганизацияПредставление	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ПодразделениеКомпанииПредставление = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.ПодразделениеКомпании, ДатаДокумента);
		// Выводим свойства
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// Готовим шапку
		НомерСтраницы = 2; НомерСтраницыПредыдущий = 2;
		СтруктураИтоговПоСтранице = Новый Структура();
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы; 
		
		// Получим данные для печати.
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УценкаТовараСкидки.НомерСтроки КАК НомерСтроки,
		|	УценкаТовараСкидки.Номенклатура КАК Номенклатура,
		|	УценкаТовараСкидки.СпособВычисления КАК СпособВычисления,
		|	УценкаТовараСкидки.ЗначениеСкидки КАК ЗначениеСкидки,
		|	УценкаТовараСкидки.ШтрихКод КАК ШтрихКод,
		|	УценкаТовараСкидки.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	УценкаТовараСкидки.ДатаОконачанияДействия КАК ДатаОконачанияДействия,
		|	УценкаТовараСкидки.СкладКомпании КАК СкладКомпании,
		|	УценкаТовараСкидки.ВариантОкругления КАК ВариантОкругления,
		|	УценкаТовараСкидки.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
		|ИЗ
		|	Документ.УценкаТовара.Скидки КАК УценкаТовараСкидки
		|ГДЕ
		|	УценкаТовараСкидки.Ссылка = &Ссылка";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		// Перебор строк
		ВыборкаТабличнойЧасти = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			// Заполняем данные строки
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТЧ);
			// Применим форматирование к полям строки.
			ОбластьСтрока.Параметры.ЗначениеСкидки	= Формат(СтрокаТЧ.ЗначениеСкидки, ФорматВыводаСуммы);
			
			// Выводим строку, делая проверку попадания на лист.
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ);
			
			// Инициализация итогов по странице.
			Если НомерСтраницы <> НомерСтраницыПредыдущий Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				НомерСтраницыПредыдущий   = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;	
		КонецЦикла;
		
		// Заполнение подвала и итогов.
		ОбластьПодвал.Параметры.СуммаПрописью = НСтр("ru = 'Всего наименований'") + Символы.НПП + ВыборкаТабличнойЧасти.Количество();
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// Блок области
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции  //ПечатьУценкаТовара()

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//	Адрес   - адрес структуры данных во временном хранилище.
//
Функция ПолучитьДанныеДляПечатиЭтикеток(МассивДокументов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УценкаТовара.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	УценкаТовара.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МИНИМУМ(УценкаТовара.НомерСтроки) КАК Порядок,
	|	СУММА(УценкаТовара.Количество) КАК Количество
	|ИЗ
	|	Документ.УценкаТовара.Скидки КАК УценкаТовара
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены.СрезПоследних КАК Цены
	|ПО
	|	Цены.Номенклатура   = УценкаТовара.Номенклатура
	|	И Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И Цены.ТипЦен        = УценкаТовара.Ссылка.ПодразделениеКомпании.ТипЦенРеализации
	|ГДЕ
	|	УценкаТовара.Ссылка В (&МассивДокументов)
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаУценкаТовара.Организация            КАК Организация,
	|	ТаблицаУценкаТовара.ПодразделениеКомпании  КАК ПодразделениеКомпании,
	|	ТаблицаУценкаТовара.ПодразделениеКомпании.ТипЦенРеализации КАК ТипЦены
	|ИЗ
	|	Документ.УценкаТовара КАК ТаблицаУценкаТовара
	|ГДЕ
	|	ТаблицаУценкаТовара.Ссылка В (&МассивДокументов)
	|";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизитыДокументов = МассивРезультатов[1].Выгрузить();
	МассивОрганизаций 			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "Организация").ВыгрузитьКолонку(0);
	МассивПодразделенийКомпании = УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "ПодразделениеКомпании").ВыгрузитьКолонку(0);
	МассивТиповЦен    			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "ТипЦены").ВыгрузитьКолонку(0);
	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(МассивОрганизаций.Количество() = 1, МассивОрганизаций[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьПодразделениеКомпании", ?(МассивПодразделенийКомпании.Количество() = 1, МассивПодразделенийКомпании[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьСклад",       Неопределено);
	СтруктураДействий.Вставить("ЗаполнитьТипЦены",     ?(МассивТиповЦен.Количество() = 1,    МассивТиповЦен[0],    Неопределено));
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Истина);
	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЭтикеток");
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	
	// Подготовка данных для заполнения табличной части обработки печати ценников и этикеток.
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//	Адрес - адрес структуры данных во временном хранилище.
//
Функция ПолучитьДанныеДляПечатиЦенников(МассивДокументов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УценкаТовара.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	УценкаТовара.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МИНИМУМ(УценкаТовара.НомерСтроки) КАК Порядок,
	|	СУММА(УценкаТовара.Количество) КАК Количество
	|ИЗ
	|	Документ.УценкаТовара.Скидки КАК УценкаТовара
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены.СрезПоследних КАК Цены
	|ПО
	|	Цены.Номенклатура   = УценкаТовара.Номенклатура
	|	И Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И Цены.ТипЦен        = УценкаТовара.Ссылка.ПодразделениеКомпании.ТипЦенРеализации
	|ГДЕ
	|	УценкаТовара.Ссылка В (&МассивДокументов)
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаУценкаТовара.Организация            КАК Организация,
	|	ТаблицаУценкаТовара.ПодразделениеКомпании  КАК ПодразделениеКомпании,
	|	ТаблицаУценкаТовара.ПодразделениеКомпании.ТипЦенРеализации КАК ТипЦены
	|ИЗ
	|	Документ.УценкаТовара КАК ТаблицаУценкаТовара
	|ГДЕ
	|	ТаблицаУценкаТовара.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизитыДокументов = МассивРезультатов[1].Выгрузить();
	МассивОрганизаций 			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "Организация").ВыгрузитьКолонку(0);
	МассивПодразделенийКомпании = УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "ПодразделениеКомпании").ВыгрузитьКолонку(0);
	МассивТиповЦен    			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "ТипЦены").ВыгрузитьКолонку(0);

	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(МассивОрганизаций.Количество() = 1, МассивОрганизаций[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьПодразделениеКомпании", ?(МассивПодразделенийКомпании.Количество() = 1, МассивПодразделенийКомпании[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьСклад",       Неопределено);
	СтруктураДействий.Вставить("ЗаполнитьВидЦены",     ?(МассивТиповЦен.Количество() = 1,    МассивТиповЦен[0],    Неопределено));
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Истина);
	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЦенников");
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЦенниковПоДокументу");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	
	// Подготовка данных для заполнения табличной части обработки печати ценников и этикеток.
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "СкидкиПерезаполнитьЦенамиЦентральногоОфиса",, "Скидки", НСтр("ru = 'Перезаполнить ценами центрального офиса'"),,,,, Ложь);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("СкидкиПерезаполнитьЦенамиЦентральногоОфиса.Видимость",    Истина);
	ПараметрыКоманд.Вставить("СкидкиПерезаполнитьЦенамиЦентральногоОфиса.Доступность",  Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик перезаполнения документа ценами центрального офиса
//
Функция СкидкиПерезаполнитьЦенамиЦентральногоОфиса(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	ИСТИНА КАК ОформленВЦО
	|ПОМЕСТИТЬ
	|	ТаблицаНоменклатуры
	|ИЗ
	|	ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|ВЫБРАТЬ
	|	УценкаТовараСрезПоследнихПриоритет.Период,
	|	УценкаТовараСрезПоследнихПриоритет.Номенклатура,
	|	УценкаТовараСрезПоследнихПриоритет.ОформленВЦО КАК ОформленВЦО,
	|	УценкаТовараСрезПоследнихПриоритет.ЗначениеСкидки КАК ЗначениеСкидки,
	|	УценкаТовараСрезПоследнихПриоритет.СпособВычисления КАК СпособВычисления,
	|	УценкаТовараСрезПоследнихПриоритет.ВариантОкругления КАК ВариантОкругления
	|ПОМЕСТИТЬ
	|	ПредварительнаяУценка
	|ИЗ
	|	РегистрСведений.УценкаТовара.СрезПоследних(&МоментВремени, (НЕ Регистратор = &Регистратор) И ПодразделениеКомпании = &Подразделение И (Номенклатура, ОформленВЦО) В
	|			(ВЫБРАТЬ Номенклатура, ОформленВЦО ИЗ ТаблицаНоменклатуры)) КАК УценкаТовараСрезПоследнихПриоритет
	|ГДЕ
	|	УценкаТовараСрезПоследнихПриоритет.Действует = ИСТИНА
	|;
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПредварительнаяУценка.Период) КАК Период,
	|	ПредварительнаяУценка.Номенклатура
	|ПОМЕСТИТЬ
	|	УценкаСрез
	|ИЗ
	|	ПредварительнаяУценка КАК ПредварительнаяУценка
	|СГРУППИРОВАТЬ ПО
	|	ПредварительнаяУценка.Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УценкаСрез.Номенклатура,
	|	ПредварительнаяУценка.ОформленВЦО КАК ОформленВЦО,
	|	ПредварительнаяУценка.ЗначениеСкидки КАК ЗначениеСкидки,
	|	ПредварительнаяУценка.СпособВычисления КАК СпособВычисления,
	|	ПредварительнаяУценка.ВариантОкругления КАК ВариантОкругления
	|ПОМЕСТИТЬ
	|	УценкаСПриоритетом
	|ИЗ
	|	УценкаСрез КАК УценкаСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ПредварительнаяУценка КАК ПредварительнаяУценка
	|ПО
	|	ПредварительнаяУценка.Период = УценкаСрез.Период И 
	|	ПредварительнаяУценка.Номенклатура = УценкаСрез.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	ТабличнаяЧасть.НомерСтроки-1 КАК ИндексСтроки,
	|	ТабличнаяЧасть.Номенклатура,
	|	ТабличнаяЧасть.Номенклатура.Код КАК НоменклатураКод,
	|	ТабличнаяЧасть.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЕСТЬNULL(УценкаСПриоритетом.ОформленВЦО, Ложь) КАК ОформленВЦО,
	|	ЕСТЬNULL(УценкаСПриоритетом.ЗначениеСкидки, 0) КАК ЗначениеСкидки,
	|	УценкаСПриоритетом.СпособВычисления КАК СпособВычисления,
	|	УценкаСПриоритетом.ВариантОкругления КАК ВариантОкругления
	|ИЗ
	|	ТабличнаяЧасть КАК ТабличнаяЧасть
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	УценкаСПриоритетом КАК УценкаСПриоритетом
	|ПО
	|	ТабличнаяЧасть.Номенклатура = УценкаСПриоритетом.Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	ИндексСтроки
	|";
	
	Запрос.УстановитьПараметр("ТабличнаяЧасть", Объект.Скидки.Выгрузить( , "НомерСтроки, Номенклатура"));
	Запрос.УстановитьПараметр("МоментВремени",  Объект.ДатаНачалаДействия);
	Запрос.УстановитьПараметр("Регистратор",    Объект.Ссылка);
	Запрос.УстановитьПараметр("Подразделение",  Объект.ПодразделениеКомпании);
	
	ЕстьЗапретРедактирования = ЕстьРеквизит(Объект, "ЗапретРедактированияЦены", "Скидки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВариантОкругления = Null Тогда
			ВывестиСообщение(НСтр("ru = 'Строка <%1>: Товар'") + Символы.НПП + "["+СокрЛП(Выборка.НоменклатураКод)+"] "+СокрЛП(Выборка.НоменклатураНаименование) 
								+ НСтр("ru = 'Не найдена цена установленная в ЦО'"),
								Объект,"Скидки[#].Номенклатура",Выборка.НомерСтроки,,Выборка.НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока = Объект.Скидки[Выборка.ИндексСтроки];
		ТекущаяСтрока.СпособВычисления  = Выборка.СпособВычисления;
		ТекущаяСтрока.ЗначениеСкидки    = Выборка.ЗначениеСкидки;
		ТекущаяСтрока.ВариантОкругления = Выборка.ВариантОкругления;
		Если ЕстьЗапретРедактирования Тогда
			ТекущаяСтрока.ЗапретРедактированияЦены = Выборка.ОформленВЦО;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ПараметрыДействия.Вставить("ТолькоОформленныеВЦО", Истина);
	
	ЗаполнитьИтоговыеЦены(Объект,,, ПараметрыДействия);
	
КонецФункции // СкидкиПерезаполнитьЦенамиЦентральногоОфиса()


#КонецЕсли
